Revit 2024 API
FormulaEditingEventArgs.Formula Property
 Returns text of the formula that will be modified
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public string Formula { get; }
Visual Basic
Public ReadOnly Property Formula As String
	Get
Visual C++
public:
property String^ Formula {
	String^ get ();
}
See Also
FormulaEditingEventArgs Class
Autodesk.Revit.UI.Events Namespace